---
kind: property
id: P:Autodesk.Revit.DB.FabricationItemFolder.IsValidObject
source: html/980ab40a-ca34-ef63-4e0a-924a21824ee3.htm
---
# Autodesk.Revit.DB.FabricationItemFolder.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.